; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-4)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city3)
	(= (capacity plane1) 11150)
	(= (fuel plane1) 1288)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 9)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 8)
	(at plane2 city3)
	(= (capacity plane2) 9927)
	(= (fuel plane2) 2450)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 14)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 5)
	(at plane3 city1)
	(= (capacity plane3) 7651)
	(= (fuel plane3) 1509)
	(= (slow-burn plane3) 3)
	(= (fast-burn plane3) 11)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 4)
	(at plane4 city3)
	(= (capacity plane4) 11490)
	(= (fuel plane4) 1860)
	(= (slow-burn plane4) 4)
	(= (fast-burn plane4) 9)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 7)
	(at plane5 city1)
	(= (capacity plane5) 13886)
	(= (fuel plane5) 1637)
	(= (slow-burn plane5) 5)
	(= (fast-burn plane5) 18)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 7)
	(at person1 city1)
	(at person2 city3)
	(at person3 city3)
	(at person4 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 794)
	(= (distance city0 city2) 783)
	(= (distance city0 city3) 506)
	(= (distance city1 city0) 794)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 801)
	(= (distance city1 city3) 734)
	(= (distance city2 city0) 783)
	(= (distance city2 city1) 801)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 781)
	(= (distance city3 city0) 506)
	(= (distance city3 city1) 734)
	(= (distance city3 city2) 781)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city1)
	(at plane5 city2)
	(at person1 city2)
	(at person2 city0)
	(at person3 city1)
	(at person4 city1)
	))

(:metric minimize (+ (* 5 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (refuel plane5 city1)
   changed: (fuel plane5) from 1637 to 13886
   goals met: 0 of 6
2. (board person1 plane5 city1)
   deleted: (at person1 city1)
   added: (in person1 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 0 of 6
3. (board person3 plane1 city3)
   deleted: (at person3 city3)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 0 of 6
4. (fly plane5 city1 city2)
   deleted: (at plane5 city1)
   added: (at plane5 city2)
   changed: (total-fuel-used) from 0 to 4005, (fuel plane5) from 13886 to 9881
   goals met: 1 of 6
5. (debark person1 plane5 city2)
   deleted: (in person1 plane5)
   added: (at person1 city2)
   changed: (onboard plane5) from 1 to 0
   goals met: 2 of 6
6. (refuel plane1 city3)
   changed: (fuel plane1) from 1288 to 11150
   goals met: 2 of 6
7. (zoom plane1 city3 city1)
   deleted: (at plane1 city3)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 4005 to 10611, (fuel plane1) from 11150 to 4544
   goals met: 3 of 6
8. (debark person3 plane1 city1)
   deleted: (in person3 plane1)
   added: (at person3 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 6
9. (board person2 plane2 city3)
   deleted: (at person2 city3)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 4 of 6
10. (fly plane2 city3 city0)
   deleted: (at plane2 city3)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 10611 to 12635, (fuel plane2) from 2450 to 426
   goals met: 4 of 6
11. (debark person2 plane2 city0)
   deleted: (in person2 plane2)
   added: (at person2 city0)
   changed: (onboard plane2) from 1 to 0
   goals met: 5 of 6
12. (board person4 plane5 city2)
   deleted: (at person4 city2)
   added: (in person4 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 5 of 6
13. (fly plane5 city2 city1)
   deleted: (at plane5 city2)
   added: (at plane5 city1)
   changed: (total-fuel-used) from 12635 to 16640, (fuel plane5) from 9881 to 5876
   goals met: 4 of 6
14. (debark person4 plane5 city1)
   deleted: (in person4 plane5)
   added: (at person4 city1)
   changed: (onboard plane5) from 1 to 0
   goals met: 5 of 6
15. (fly plane5 city1 city2)
   deleted: (at plane5 city1)
   added: (at plane5 city2)
   changed: (total-fuel-used) from 16640 to 20645, (fuel plane5) from 5876 to 1871
   goals met: 6 of 6
